app/views/ingredients/show.html.erb

<div class="container-footer-margin">
<% @ingredient.products.each do |product| %>
---
SELECT "products".* FROM "products" INNER JOIN "formulas" ON "products"."id" = "formulas"."product_id" WHERE "formulas"."ingredient_id" = ?  [["ingredient_id", 3]]