app/controllers/products_controller.rb

INSERT INTO "products" ("brand", "name", "image", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["brand", ""], ["name", ""], ["image", ""], ["created_at", "2015-08-01 01:08:08.171386"], ["updated_at", "2015-08-01 01:08:08.171386"]]
---
	def create
		@product = Product.new(product_params)
		@product.save