app/views/products/show.html.erb

		Ingredients:
		<% @product.ingredients.each do |ingredient| %>
---
SELECT "ingredients".* FROM "ingredients" INNER JOIN "formulas" ON "ingredients"."id" = "formulas"."ingredient_id" WHERE "formulas"."product_id" = ?  [["product_id", 14]]